# 23. Створити клас ТDate, який містить трійку цілих чисел, що представляють чис -
# ло, місяць та рік, і методи для порівняння дат, заданих різними форматами, їх збі -
# льшення / зменшення на вказану величину.На основі цього класу створити класи -
# нащадки TDate1 та TDate2, що представляють дати в форматі "ЧЧ.ММ.РРРР" та
# "ММ-ЧЧ-РРРР" відповідно. Створити n об'єктів TDate1 та m об'єктів TDate2.
# Визначити саму пізню дату, а також дати, що належать заданому періоду дат.

from TDate import *

n = int(input("Введите n: "))
lst = [TDate1(input()) for i in range(n)]
m = int(input("Введите m: "))
lst += [TDate2(input()) for j in range(m)]
print(max(lst, key=lambda x: x.get_days_since_year_0()))
date1 = input("Введите нижний предел диапазона дат: ")
date2 = input("Введите верхний предел диапазона дат: ")
print("Даты, которые входят в заданный диапазон")
for i in lst:
    if i.is_in_time_interval(date1, date2):
        print(i)
