# Створити файл із списком клієнтів, обслужених менеджером протягом дня:
# прізвище, час приходу та час закінчення обслуговування. При введенні даних
# перевіряти їхню допустимість (чи не перетинаються клієнти з наявними).
# Створити новий файл, який містить інформацію про клієнтів, з якими менеджер
# спілкувався понад 30 хв.

from func import *

FName1 = input("Введите имя файла: ")
create_file(FName1)
print_file(FName1)
FName2 = input("Введите имя нового файла: ")
create_new_file(FName1, FName2)
print_file(FName2)